---
kind: other
id: Methods.T:Autodesk.Revit.DB.Mechanical.MechanicalFitting
source: html/8de9b205-4aa0-dd5c-0a07-e667c31a5399.htm
---
# MechanicalFitting Methods

Causes the object to release immediately any resources it may be utilizing.